//начало текста модуля

#Область Служебные_функции_и_процедуры

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯПришелВЛес()","ЯПришелВЛес","Дано Я пришел в лес");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗаглядываюПодКуст()","ЯЗаглядываюПодКуст","Когда я заглядываю под куст");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ПодКустомСидитПтицаСКрасивымХвостом()","ПодКустомСидитПтицаСКрасивымХвостом","И под кустом сидит птица с красивым хвостом");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯВижуФазана()","ЯВижуФазана","Тогда я вижу фазана");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯНашелФазана()","ЯНашелФазана","Дано Я нашел фазана");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"РасстояниеМеждуМнойИФазаномМеньшеПолуметра()","РасстояниеМеждуМнойИФазаномМеньшеПолуметра","Когда расстояние между мной и фазаном меньше полуметра");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ФазанНеВидитМеня()","ФазанНеВидитМеня","И фазан не видит меня");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯБеруВРукиФазана()","ЯБеруВРукиФазана","Тогда я беру в руки фазана");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

#КонецОбласти



#Область Работа_со_сценариями

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Дано Я пришел в лес
//@ЯПришелВЛес()
Процедура ЯПришелВЛес() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда я заглядываю под куст
//@ЯЗаглядываюПодКуст()
Процедура ЯЗаглядываюПодКуст() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И под кустом сидит птица с красивым хвостом
//@ПодКустомСидитПтицаСКрасивымХвостом()
Процедура ПодКустомСидитПтицаСКрасивымХвостом() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда я вижу фазана
//@ЯВижуФазана()
Процедура ЯВижуФазана() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Дано Я нашел фазана
//@ЯНашелФазана()
Процедура ЯНашелФазана() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда расстояние между мной и фазаном меньше полуметра
//@РасстояниеМеждуМнойИФазаномМеньшеПолуметра()
Процедура РасстояниеМеждуМнойИФазаномМеньшеПолуметра() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И фазан не видит меня
//@ФазанНеВидитМеня()
Процедура ФазанНеВидитМеня() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда я беру в руки фазана
//@ЯБеруВРукиФазана()
Процедура ЯБеруВРукиФазана() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//окончание текста модуля